devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to UART
 */
//==============================================================================
MODULE__DEVICE_WRITE(UART)
{
        UNUSED_ARG(lseek);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(item_size == 0);
        STOP_IF(n_items == 0);

        struct USART_data *hdl = device_handle;

        size_t n = 0;
        if (lock_mutex(hdl->port_lock_tx_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = item_size * n_items;

                enable_TXE_IRQ(hdl->USART);
                take_semaphore(hdl->data_write_sem, TXC_WAIT_TIME);

                n = n_items;

                unlock_mutex(hdl->port_lock_tx_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from UART Rx buffer
 */
//==============================================================================
MODULE__DEVICE_READ(UART)
{
        UNUSED_ARG(lseek);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(item_size == 0);
        STOP_IF(n_items == 0);

        struct USART_data *hdl = device_handle;

        size_t n = 0;
        if (lock_mutex(hdl->port_lock_rx_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                u8_t  *dst_ptr   = (u8_t *)dst;
                size_t data_size = n_items * item_size;
                hdl->task_rx     = get_task_handle();

                do {
                        enter_critical_section();

                        if (hdl->Rx_FIFO.buffer_level > 0) {
                                *dst_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                        hdl->Rx_FIFO.read_index = 0;

                                hdl->Rx_FIFO.buffer_level--;
                                data_size--;
                                n++;

                                exit_critical_section();
                        } else {
                                exit_critical_section();
                                suspend_this_task();
                        }
                } while (data_size);

                n /= item_size;

                unlock_mutex(hdl->port_lock_rx_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Direct IO control
 */
//==============================================================================
MODULE__DEVICE_IOCTL(UART)
{
        STOP_IF(device_handle == NULL);

        struct USART_data *hdl = device_handle;
        stdret_t status = STD_RET_OK;
        u8_t *out_ptr;

        switch (iorq) {
        case UART_IORQ_ENABLE_WAKEUP_IDLE:
                wakeup_USART_on_idle_line(hdl->USART);
                break;

        case UART_IORQ_ENABLE_WAKEUP_ADDRESS_MARK:
                wakeup_USART_on_address_mark(hdl->USART);
                break;

        case UART_IORQ_ENABLE_PARITY_CHECK:
                enable_parity_check(hdl->USART);
                break;

        case UART_IORQ_DISABLE_PARITY_CHECK:
                disable_parity_check(hdl->USART);
                break;

        case UART_IORQ_SET_ODD_PARITY:
                enable_odd_parity(hdl->USART);
                break;

        case UART_IORQ_SET_EVEN_PARITY:
                enable_even_parity(hdl->USART);
                break;

        case UART_IORQ_ENABLE_RECEIVER_WAKEUP_MUTE:
                receiver_wakeup_in_mute_mode(hdl->USART);
                break;

        case UART_IORQ_DISABLE_RECEIVER_WAKEUP_MUTE:
                receiver_wakeup_in_active_mode(hdl->USART);
                break;

        case UART_IORQ_ENABLE_LIN_MODE:
                enable_LIN_mode(hdl->USART);
                break;

        case UART_IORQ_DISABLE_LIN_MODE:
                disable_LIN_mode(hdl->USART);
                break;

        case UART_IORQ_SET_1_STOP_BIT:
                set_1_stop_bit(hdl->USART);
                break;

        case UART_IORQ_SET_2_STOP_BITS:
                set_2_stop_bits(hdl->USART);
                break;

        case UART_IORQ_SET_LIN_BRK_DETECTOR_11_BITS:
                detect_11_bit_LIN_break(hdl->USART);
                break;

        case UART_IORQ_SET_LIN_BRK_DETECTOR_10_BITS:
                detect_10_bit_LIN_break(hdl->USART);
                break;

        case UART_IORQ_SET_ADDRESS_NODE:
                set_address_node(hdl->USART, va_arg(args, int));
                break;

        case UART_IORQ_ENABLE_CTS:
                enable_CTS(hdl->USART);
                break;

        case UART_IORQ_DISABLE_CTS:
                disable_CTS(hdl->USART);
                break;

        case UART_IORQ_ENABLE_RTS:
                enable_RTS(hdl->USART);
                break;

        case UART_IORQ_DISABLE_RTS:
                disable_RTS(hdl->USART);
                break;

        case UART_IORQ_GET_BYTE:
                enter_critical_section();

                if (!(out_ptr = va_arg(args, u8_t*))) {
                        exit_critical_section();
                        status = STD_RET_ERROR;
                        break;
                }

                if (hdl->Rx_FIFO.buffer_level > 0) {
                        *out_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                        if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                hdl->Rx_FIFO.read_index = 0;

                        hdl->Rx_FIFO.buffer_level--;
                } else {
                        status = STD_RET_ERROR;
                }

                exit_critical_section();
                break;

        case UART_IORQ_GET_BYTE_BLOCKING:
                while (TRUE) {
                        enter_critical_section();

